dave-abq/mpy_lpx546/nxp_lpc546/sdmmc/fsl_mmc.c
    /* Ignore errors in bus test procedure to improve chances that the test will work. */
    data.enableIgnoreError = true;
    data.blockCount = 1U;
    data.blockSize = blockSize;
    data.rxData = pattern;

    content.command = &command;
    content.data = &data;
    if ((kStatus_Success != card->host.transfer(card->host.base, &content)) ||
        ((command.response[0U]) & kSDMMC_R1ErrorAllFlag))
    {
        return kStatus_SDMMC_TransferFailed;
    }

    return kStatus_Success;
}

static status_t MMC_TestDataBusWidth(mmc_card_t *card, mmc_data_bus_width_t width)
{
    assert(card);

    uint32_t blockSize;
    uint32_t sendPattern[2U] = {0};
    uint32_t receivedPattern[2U] = {0};
    uint32_t xorMask;
    uint32_t xorResult, tempResult = 0U;

    /* For 8 data lines the data block would be (MSB to LSB): 0x0000_0000_0000_AA55,
    For 4 data lines the data block would be (MSB to LSB): 0x0000_005A,
    For only 1 data line the data block would be: 0x80 */
    switch (width)
    {
        case kMMC_DataBusWidth8bit:
            blockSize = 8U;
            sendPattern[0U] = 0xAA55U;
            xorMask = 0xFFFFU;
            xorResult = 0xFFFFU;
            break;
        case kMMC_DataBusWidth4bit:
            blockSize = 4U;
            sendPattern[0U] = 0x5AU;
            xorMask = 0xFFU;
            xorResult = 0xFFU;
            break;
        default:
            blockSize = 4U;
            sendPattern[0U] = 0x80U;
            xorMask = 0xFFU;
            xorResult = 0xC0U;
            break;
    }
    switch (card->host.config.endianMode)
    {
        case kHOST_EndianModeLittle:
            /* Doesn't need to switch byte sequence when decodes bytes as little endian sequence. */
            break;
        case kHOST_EndianModeBig:
            /* In big endian mode, the byte transferred first is the byte stored in highest byte position in a word
            which will cause the card receive the inverted byte sequence in a word in bus test procedure. So the
            sequence of 4 bytes stored in a word should be converted. */
            sendPattern[0] = SWAP_WORD_BYTE_SEQUENCE(sendPattern[0]);
            xorMask = SWAP_WORD_BYTE_SEQUENCE(xorMask);
            xorResult = SWAP_WORD_BYTE_SEQUENCE(xorResult);
            break;
        case kHOST_EndianModeHalfWordBig:
            /* In half word big endian mode, the byte transferred first is the lower byte in the higher half word.
            0xAA55U should be converted to 0xAA550000U to set the 0x55 to be the first byte to transfer. */
            sendPattern[0] = SWAP_HALF_WROD_BYTE_SEQUENCE(sendPattern[0]);
            xorMask = SWAP_HALF_WROD_BYTE_SEQUENCE(xorMask);
            xorResult = SWAP_HALF_WROD_BYTE_SEQUENCE(xorResult);
            sendPattern[0] = SWAP_WORD_BYTE_SEQUENCE(sendPattern[0]);
            xorMask = SWAP_WORD_BYTE_SEQUENCE(xorMask);
            xorResult = SWAP_WORD_BYTE_SEQUENCE(xorResult);
            break;
        default:
            return kStatus_SDMMC_NotSupportYet;
    }

    if (kStatus_Success != MMC_SendTestPattern(card, blockSize, sendPattern))
    {
        return kStatus_SDMMC_SendTestPatternFailed;
    }
    if (kStatus_Success != MMC_ReceiveTestPattern(card, blockSize, receivedPattern))
    {
        return kStatus_SDMMC_ReceiveTestPatternFailed;
    }

    tempResult = (sendPattern[0U] ^ receivedPattern[0U]) & xorMask;
    /* XOR the send pattern and receive pattern */
    if (tempResult != xorResult)
    {
        return kStatus_Fail;
    }

    return kStatus_Success;
}

static status_t MMC_SetDataBusWidth(mmc_card_t *card, mmc_data_bus_width_t width)
{
    assert(card);

    mmc_extended_csd_config_t extendedCsdconfig;

    /* Set power class corresponding to bus width. From the Extended CSD the host can learn the power class of the card
    and choose to work with a wider data bus. */
    if (kStatus_Success != MMC_SetPowerClass(card, width))
    {
        return kStatus_SDMMC_SetPowerClassFail;
    }

    if ((width == kMMC_DataBusWidth4bit) && ((card->currentTiming == kMMC_HighSpeedDDR52180V300VTiming) ||
                                             (card->currentTiming == kMMC_HighSpeedDDR52120VTiming)))
    {
        width = kMMC_DataBusWidth4bitDDR;
    }

    if ((width == kMMC_DataBusWidth8bit) &&
        ((card->currentTiming == kMMC_HighSpeedDDR52180V300VTiming) ||
         (card->currentTiming == kMMC_HighSpeedDDR52120VTiming) || (card->currentTiming == kMMC_HighSpeed400Timing)))
    {
        width = kMMC_DataBusWidth8bitDDR;
    }

    /* Set data bus width */
    extendedCsdconfig.accessMode = kMMC_ExtendedCsdAccessModeWriteBits;
    extendedCsdconfig.ByteIndex = kMMC_ExtendedCsdIndexBusWidth;
    extendedCsdconfig.ByteValue = width;
    extendedCsdconfig.commandSet = kMMC_CommandSetStandard;
    if (kStatus_Success != MMC_SetExtendedCsdConfig(card, &extendedCsdconfig))
    {
        return kStatus_SDMMC_ConfigureExtendedCsdFailed;
    }
    /* restore data bus width */
    card->extendedCsd.dataBusWidth = width;

    return kStatus_Success;
}

static status_t MMC_SetMaxDataBusWidth(mmc_card_t *card)
{
    assert(card);

    status_t error = kStatus_Fail;

    /* Test and set the data bus width for card. */
    if (card->host.capability.flags & kHOST_Support8BitBusWidth)
    {
        HOST_SET_CARD_BUS_WIDTH(card->host.base, kHOST_DATABUSWIDTH8BIT);
        if ((kStatus_Success == MMC_TestDataBusWidth(card, kMMC_DataBusWidth8bit)) &&
            (kStatus_Success == MMC_SetDataBusWidth(card, kMMC_DataBusWidth8bit)))
        {
            card->flags |= kMMC_DataBusWidth8BitFlag;
            error = kStatus_Success;
        }
    }
    /* HS400 mode only support 8bit data bus */
    if ((error == kStatus_Fail) && (card->currentTiming == kMMC_HighSpeed400Timing))
    {
        return kStatus_SDMMC_SetDataBusWidthFailed;
    }

    if ((error == kStatus_Fail) && (card->host.capability.flags & kHOST_Support4BitBusWidth))
    {
        HOST_SET_CARD_BUS_WIDTH(card->host.base, kHOST_DATABUSWIDTH4BIT);
        if ((kStatus_Success == MMC_TestDataBusWidth(card, kMMC_DataBusWidth4bit)) &&
            (kStatus_Success == MMC_SetDataBusWidth(card, kMMC_DataBusWidth4bit)))
        {
            card->flags |= kMMC_DataBusWidth4BitFlag;
            error = kStatus_Success;
        }
    }

    /* HS200/DDR mode only support 4bit/8bit data bus */
    if ((error == kStatus_Fail) && ((card->currentTiming == kMMC_HighSpeed200Timing) ||
                                    (card->currentTiming == kMMC_HighSpeedDDR52180V300VTiming) ||
                                    (card->currentTiming == kMMC_HighSpeedDDR52120VTiming)))
    {
        return kStatus_SDMMC_SetDataBusWidthFailed;
    }

