dave-abq/mpy_lpx546/nxp_lpc546/sdmmc/fsl_mmc.c
    if (error == kStatus_Fail)
    {
        card->flags |= kMMC_DataBusWidth1BitFlag;
        /* Card's data bus width will be default 1 bit mode. */
        HOST_SET_CARD_BUS_WIDTH(card->host.base, kHOST_DATABUSWIDTH1BIT);
    }

    return kStatus_Success;
}

static status_t MMC_SelectCardDriverStrength(mmc_card_t *card, uint8_t driverStrength)
{
    assert(card);

    uint8_t ioStrength = 0U;
    mmc_extended_csd_config_t extendedCsdconfig;

    ioStrength = card->extendedCsd.highSpeedTiming | (uint8_t)(driverStrength << 4U);

    /* Switch to high speed timing. */
    extendedCsdconfig.accessMode = kMMC_ExtendedCsdAccessModeWriteBits;
    extendedCsdconfig.ByteIndex = kMMC_ExtendedCsdIndexHighSpeedTiming;
    extendedCsdconfig.ByteValue = ioStrength;
    extendedCsdconfig.commandSet = kMMC_CommandSetStandard;
    if (kStatus_Success != MMC_SetExtendedCsdConfig(card, &extendedCsdconfig))
    {
        return kStatus_SDMMC_ConfigureExtendedCsdFailed;
    }

    card->extendedCsd.highSpeedTiming |= ioStrength;

    return kStatus_Success;
}

static status_t MMC_SelectBusTiming(mmc_card_t *card)
{
    assert(card);

    uint32_t value = 0U;
    uint32_t targetFreq = 0U;

    mmc_extended_csd_config_t extendedCsdconfig;

    /* 1.8V and 1.2V timing select */
    if (((kHOST_SupportHS200 != HOST_NOT_SUPPORT) || (kHOST_SupportHS400 != HOST_NOT_SUPPORT) ||
         (kHOST_SupportDDR50 != HOST_NOT_SUPPORT)) &&
        ((card->hostVoltageWindow == kMMC_VoltageWindow170to195) || (card->hostVoltageWindow == kMMC_VoltageWindow120)))
    {
        switch (card->currentTiming)
        {
            case kMMC_HighSpeedTimingNone:
            case kMMC_HighSpeed400Timing:
                if ((card->host.capability.flags & kHOST_SupportHS400) &&
                    (card->flags & kMMC_SupportHS400DDR200MHZ180VFlag))
                {
                    value = kMMC_HighSpeed400Timing;
                    card->currentTiming = kMMC_HighSpeed400Timing;
                    targetFreq = HOST_SUPPORT_HS400_FREQ;
                    break;
                }
            case kMMC_HighSpeed200Timing:
                if ((card->flags & kMMC_SupportHS200200MHZ180VFlag) &&
                    ((card->host.capability.flags & kHOST_SupportHS200)))
                {
                    value = kMMC_HighSpeed200Timing;
                    card->currentTiming = kMMC_HighSpeed200Timing;
                    targetFreq = HOST_SUPPORT_HS200_FREQ;
                    break;
                }
            case kMMC_HighSpeedDDR52120VTiming:
            case kMMC_HighSpeedDDR52180V300VTiming:
                if ((card->hostVoltageWindow == kMMC_VoltageWindow170to195))
                {
                    if ((card->flags & kMMC_SupportHighSpeedDDR52MHZ180V300VFlag) &&
                        (card->host.capability.flags & kHOST_SupportDDR50))
                    {
                        targetFreq = MMC_CLOCK_DDR52;
                        value = kMMC_HighSpeedTiming;
                        card->currentTiming = kMMC_HighSpeedDDR52180V300VTiming;
                        break;
                    }
                }
                else
                {
                    if ((card->flags & kMMC_SupportHighSpeedDDR52MHZ120VFlag) &&
                        (card->host.capability.flags & kHOST_SupportDDR50))
                    {
                        value = kMMC_HighSpeedTiming;
                        targetFreq = MMC_CLOCK_DDR52;
                        card->currentTiming = kMMC_HighSpeedDDR52120VTiming;
                        break;
                    }
                }
            case kMMC_HighSpeed52MHZTiming:
                if (card->flags & kMMC_SupportHighSpeed52MHZFlag)
                {
                    value = kMMC_HighSpeedTiming;
                    targetFreq = MMC_CLOCK_52MHZ;
                    card->currentTiming = kMMC_HighSpeed52MHZTiming;
                    break;
                }
            case kMMC_HighSpeed26MHZTiming:
                if (card->flags & kMMC_SupportHighSpeed26MHZFlag)
                {
                    value = kMMC_HighSpeedTiming;
                    targetFreq = MMC_CLOCK_26MHZ;
                    card->currentTiming = kMMC_HighSpeed26MHZTiming;
                    break;
                }

            default:
                return kStatus_SDMMC_SwitchBusTimingFailed;
        }
    }
    /* 3.3V timing */
    else if (((card->host.capability.flags) & kHOST_SupportHighSpeed) || (kHOST_SupportDDR50 != HOST_NOT_SUPPORT))
    {
        /* high speed mode */
        value = kMMC_HighSpeedTiming;

        switch (card->currentTiming)
        {
            case kMMC_HighSpeedTimingNone:
            case kMMC_HighSpeed400Timing:
            case kMMC_HighSpeed200Timing:
            case kMMC_HighSpeedDDR52120VTiming:
            case kMMC_HighSpeedDDR52180V300VTiming:
                if ((card->flags & kMMC_SupportHighSpeedDDR52MHZ180V300VFlag) &&
                    (kHOST_SupportDDR50 != HOST_NOT_SUPPORT))
                {
                    targetFreq = MMC_CLOCK_DDR52;
                    card->currentTiming = kMMC_HighSpeedDDR52180V300VTiming;
                    break;
                }
            case kMMC_HighSpeed52MHZTiming:
                if (card->flags & kMMC_SupportHighSpeed52MHZFlag)
                {
                    targetFreq = MMC_CLOCK_52MHZ;
                    card->currentTiming = kMMC_HighSpeed52MHZTiming;
                    break;
                }
            case kMMC_HighSpeed26MHZTiming:
                if (card->flags & kMMC_SupportHighSpeed26MHZFlag)
                {
                    targetFreq = MMC_CLOCK_26MHZ;
                    card->currentTiming = kMMC_HighSpeed26MHZTiming;
                    break;
                }
            default:
                return kStatus_SDMMC_SwitchBusTimingFailed;
        }
    }
    else
    {
        /*default mode*/
        value = 0U;
        card->currentTiming = kMMC_HighSpeedTimingNone;
    }

    if (card->currentTiming == kMMC_HighSpeed200Timing)
    {
        /* select bus width before select bus timing for HS200 mode */
        if (MMC_SetMaxDataBusWidth(card) != kStatus_Success)
        {
            return kStatus_SDMMC_SetDataBusWidthFailed;
        }
    }

